snlkuharlocal/src/DataProcessors/РассылкаУведомленийОПлатежах/РассылкаУведомленийОПлатежах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РассылкаУведомленийОПлатежах</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/УведомленияОПоступившихПлатежах/УведомленияОПоступившихПлатежах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомленияОПоступившихПлатежах</name>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Documents/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвиженияДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоПоАвансамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Приход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаБанкКлиент</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПоБанку</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС_Бух</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_СтрокиПлатежа</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкиЗатрат</name>
    <attributes>
      <name>ИД_СтрокиПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Затраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КаналСбыта</name>
      <type>
        <types>CatalogRef.КаналСбыта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/РассылкаУведомленийОПлатежах/ObjectModule.bsl
Функция ВыполнитьРассылку(пОбработки) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	СоздаватьПисьма = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "СоздаватьПисьма", Ложь);
	
	Дата1			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата1", ПолучитьНачальнуюДатуРассылки());
	Дата2			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата2", НачалоДня(ТекущаяДата())-1);
	
	Организация		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Организация");
	
	#Область ТекстЗапроса	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка 								КАК ППВходящее,
	|	НАЧАЛОПЕРИОДА(Ссылка.Дата, ДЕНЬ) 	КАК ПериодДень,
	|
	|	Контрагент,
	|	Контрагент.Код						КАК Контрагент_Код,
	|
	|	Договор,
	|	Договор.Номер 						КАК Договор_Номер,
	|	Договор.Дата 						КАК Договор_Дата,
	|	Договор.Код 						КАК Договор_Код,
	|
	|	Контрагент.Менеджер					КАК Менеджер,
	|	Контрагент.Менеджер.ЕМэйл			КАК ЕМэйл,
	|
	|	Номер 								КАК Номер,
	|	Дата 								КАК Дата,
	|
	|	НомерВходящегоДокумента,
	|	ДатаВходящегоДокумента,
	|
	|	СуммаДокумента,
	|	НазначениеПлатежа,
	|
	|	1 КАК КоличествоСтрокОплат
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.УведомленияОПоступившихПлатежах КАК Реестр
	|ПО 
	|	ПРС.Ссылка = Реестр.ДокОснование
	|ГДЕ
	|	ПРС.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПРС.Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И ПРС.Договор.Организация = &Организация
	|	И Реестр.ДокОснование ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО
	|	Менеджер,
	|	Контрагент,
	|	ПериодДень,
	|	Номер
	|ИТОГИ СУММА(КоличествоСтрокОплат) ПО     
	|	Менеджер,
	|	Контрагент,
	|	ПериодДень	
	|";	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Дата1", 			Дата1);
	Запрос.УстановитьПараметр("Дата2", 			КонецДня(Дата2));
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Выполнить().Выбрать();
	
	ОбработаноСтрок = 0;
	СозданоПисем 	= 0;
	
	ТД = Новый ТабличныйДокумент;
	
	Выборка_Менеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
	Пока Выборка_Менеджер.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка_Менеджер.Менеджер) Тогда
			Если ЗначениеЗаполнено(Выборка_Менеджер.ЕМэйл) Тогда
				рФормирования = СоздатьРеестрОплат(Выборка_Менеджер, Дата1, Дата2);
				
				ЗаписатьУведомления(рФормирования.МассивПП, рФормирования.Менеджер);
				
				Если СоздаватьПисьма Тогда
					СоздатьПисьмоОПолученныхОплатах(рФормирования.ТД, Дата1, Выборка_Менеджер.Менеджер, Выборка_Менеджер.ЕМэйл);				
					СозданоПисем = СозданоПисем + 1;				
				КонецЕсли;
				
				Если ТД.ВысотаТаблицы > 0 Тогда
					ТД.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;				
				ТД.Вывести(рФормирования.ТД);
			Иначе
				ТекстСообщения = СтрШаблон("Не указан E-Mail у менеджера: '%1' !", Выборка_Менеджер.Менеджер);
				ЗаписатьВЛог(ИмяЛога(), ТекстСообщения, "Ошибка");
				Результат.Ошибки.Добавить(ТекстСообщения);
			КонецЕсли;
		Иначе
			Выборка = Выборка_Менеджер.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = СтрШаблон("Не указан менеджер у конрагента: %1 (%2) !", Выборка.Контрагент, Выборка.Контрагент_Код);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецЦикла;			
		КонецЕсли;
		
		ОбработаноСтрок = ОбработаноСтрок + Выборка_Менеджер.КоличествоСтрокОплат;
	КонецЦикла;
	
	УстановитьПометкиВДДС(Дата1, КонецДня(Дата2), Организация);
	
	Результат.Данные = ТД;
	Результат.ОбработаноОбъектов = ОбработаноСтрок;
	Результат.Сообщения.Добавить("Обработано строк: " + ОбработаноСтрок + ".");
	Результат.Сообщения.Добавить("Создано писем: " + СозданоПисем + ".");
	
	ТекстСообщения = СтрШаблон("Выполнена рассылка уведомлений о поступишвих платежах за период с %1 по %2.
	|Параметр 'СоздаватьПисьма': %3.
	|Сформировано писем: %4.
	|Ошибок обработки: %5
	|	%6
	|", НачалоДня(Дата1), КонецДня(Дата2), СоздаватьПисьма, СозданоПисем, Результат.Ошибки.Количество(), СтрСоединить(Результат.Ошибки, Символы.ПС)
	);	
	
	ЗаписатьВЛог(ИмяЛога(), ТекстСообщения, "Информация"); 
	
	Возврат Результат;		
КонецФункции //ВыполнитьРассылку(пОбработки) Экспорт

Функция ПолучитьНачальнуюДатуРассылки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(Ссылка.Дата) КАК Дата
	|ИЗ
	|	Документ.ДвиженияДенежныхСредств.Платежи КАК Платежи
	|ГДЕ
	|	Ссылка.Дата >= &Дата0
	|	И НЕ Ссылка.ПисьмоПоАвансамОтправлено
	|	И Ссылка.Проведен
	|	И Договор.ВидДоговора_новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|";
	
	Результат = '20260501';
	
	Запрос.УстановитьПараметр("Дата0", Результат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) Тогда
		Результат = Выборка.Дата;	
	КонецЕсли;	                 
	Возврат Результат;
КонецФункции //ПолучитьНачальнуюДатуРассылки()

Функция УстановитьПометкиВДДС(Дата1, Дата2, Организация)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокОснование.ДокОснование КАК ДДС
	|ИЗ
	|	РегистрСведений.УведомленияОПоступившихПлатежах
	|ГДЕ
	|	ДокОснование.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ДокОснование.Организация =  &Организация
	|	И ДокОснование.ДокОснование.ПисьмоПоАвансамОтправлено = Ложь
	|";                
	
	Запрос.УстановитьПараметр("Дата1", 			Дата1);
	Запрос.УстановитьПараметр("Дата2", 			Дата2);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УстановитьРеквизитыОбъекта(Выборка.ДДС, Новый Структура("ПисьмоПоАвансамОтправлено", Истина), , Истина, Истина);
	КонецЦикла;
КонецФункции //УстановитьПометкиВДДС(Дата1, Дата2, Организация)

Функция СоздатьРеестрОплат(Выборка_Менеджер, Дата1, Дата2) Экспорт
	МассивПП	= Новый Массив;
	
	Макет		= ПолучитьМакет("РеестрОплат");	
	
	Менеджер 	= Выборка_Менеджер.Менеджер;
	
	пЗаголовка	= Новый Структура("Дата1,Дата2,Менеджер", Формат(Дата1, "ДФ=dd.MM.yyyy"), Формат(Дата2, "ДФ=dd.MM.yyyy"), Менеджер);
	пЗаголовка.Вставить("ДатаФормирования", Формат (ТекущаяДата(), "ДФ=dd.MM.yyyy HH:mm:ss"));
	пЗаголовка.Вставить("Автор", 			ПараметрыСеанса.Пользователь);	
	
	ТД = Новый ТабличныйДокумент;
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(пЗаголовка);	
	
	ТД.Вывести(ОблЗаголовок);
	
	ТД.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	ТД.НачатьАвтогруппировкуСтрок();
	
	Выборка_Контрагент = Выборка_Менеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока Выборка_Контрагент.Следующий() Цикл	
		Обл = Макет.ПолучитьОбласть("Контрагент");
		Обл.Параметры.Заполнить(Выборка_Контрагент);
		
		ТД.Вывести(Обл, Выборка_Контрагент.Уровень());
		
		Выборка_Дата = Выборка_Контрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодДень");
		Пока Выборка_Дата.Следующий() Цикл
			Обл = Макет.ПолучитьОбласть("ПериодДень");
			Обл.Параметры.Заполнить(Выборка_Дата);
		
			ТД.Вывести(Обл, Выборка_Дата.Уровень());
			
			Выборка = Выборка_Дата.Выбрать();
			Пока Выборка.Следующий() Цикл
				Обл = Макет.ПолучитьОбласть("Документ");
				Обл.Параметры.Заполнить(Выборка);
		
				ТД.Вывести(Обл, Выборка.Уровень());
				
				МассивПП.Добавить(Выборка.ППВходящее);
			КонецЦикла;			
		КонецЦикла;
	КонецЦикла;	
	
	ТД.ЗакончитьАвтогруппировкуСтрок();        
	
	ТД.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Возврат Новый Структура("ТД,МассивПП,Менеджер", ТД, МассивПП, Менеджер);
КонецФункции //СоздатьРеестрОплат(Выборка_Менеджер, ДатаС)

Функция ЗаписатьУведомления(МассивПП, Получатель)
	ДатаФормирования = ТекущаяДата();
	Автор = ПараметрыСеанса.Пользователь;
	
	Для каждого ДокОснование Из МассивПП Цикл
		Запись = РегистрыСведений.УведомленияОПоступившихПлатежах.СоздатьМенеджерЗаписи();
		
		Запись.ДокОснование 		= ДокОснование;
		Запись.ДатаФормирования     = ДатаФормирования;
		Запись.Автор				= Автор;  
		Запись.Получатель			= Получатель;
		
		Если ЗначениеЗаполнено(Запись.ДокОснование) Тогда
			Запись.Записать();		
		КонецЕсли;	
	КонецЦикла;
КонецФункции //ЗаписатьУведомления(МассивПП, Получатель)

Функция СоздатьПисьмоОПолученныхОплатах(ТД, ПериодС, Менеджер, ЕМэйл)
	Получатели = Новый Массив;
	Получатели.Добавить(ЕМэйл);	
	
	ИмяВФ = ПолучитьИмяВременногоФайла("html");
	
	ПериодПо = НачалоДня(ТекущаяДата())-1;
	
	ТД.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.HTML5);	
	
	Запись = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	Запись.ДатаСозданияПисьма 	= ТекущаяДата();
	Запись.ТемаПисьма			= СтрШаблон("Поступившие оплаты за период с %1 по %2. Менеджер: '%3'.", Формат(ПериодС, "ДФ='dd.MM.yyyy'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy'"), Менеджер);
	Запись.Основание 			= Менеджер;
	
	Запись.СписокПолучателей	= СтрСоединить(Получатели, "##");
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	Запись.ТекстПисьма = ПолучитьСтрокуИзДвоичныхДанных(ДД);
	
	ИмяВФ = ПолучитьИмяВременногоФайла("xlsx");
	ТД.Записать(ИмяВФ, ТипФайлаТабличногоДокумента.XLSX);
	
	ДД = Новый ДвоичныеДанные(ИмяВФ);
	
	Запись.Вложение = Новый ХранилищеЗначения(ДД, Новый СжатиеДанных(9));
	Запись.ИмяФайлаВложения = СтрШаблон("Поступившие оплаты за период с %1 по %2.xlsx", Формат(ПериодС, "ДФ='dd.MM.yyyy'"), Формат(ПериодПо, "ДФ='dd.MM.yyyy'"));
	
	Запись.Записать();	
	
	Возврат ТД;
КонецФункции //СоздатьПисьмоОПолученныхОПлатах(ТД, ПериодС, ЕМэйл)

Функция ИмяЛога()
	Возврат "Уведомления о пост. плат";
КонецФункции //ИмяЛога()
